{
  "_name_or_path": "cointegrated/rubert-tiny",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "3540",
    "1": "8464",
    "2": "9436",
    "3": "9437",
    "4": "9391",
    "5": "3414",
    "6": "2526",
    "7": "5361",
    "8": "9750",
    "9": "1996",
    "10": "8460",
    "11": "9295",
    "12": "3185",
    "13": "3416",
    "14": "2321",
    "15": "5500",
    "16": "2381",
    "17": "3451",
    "18": "2293",
    "19": "9461",
    "20": "5772",
    "21": "1481",
    "22": "5157",
    "23": "5331",
    "24": "5982",
    "25": "2553",
    "26": "3483",
    "27": "3181",
    "28": "9393",
    "29": "9480",
    "30": "9146",
    "31": "9180",
    "32": "1991",
    "33": "2364",
    "34": "9439",
    "35": "9350",
    "36": "9433",
    "37": "9434",
    "38": "9381",
    "39": "2571",
    "40": "9683",
    "41": "5711",
    "42": "2420",
    "43": "9386",
    "44": "5530",
    "45": "2514",
    "46": "9432",
    "47": "8311",
    "48": "9451",
    "49": "2545",
    "50": "9291",
    "51": "2557",
    "52": "2440",
    "53": "2431",
    "54": "5481",
    "55": "5620",
    "56": "7272",
    "57": "9464",
    "58": "9396",
    "59": "5970",
    "60": "9389",
    "61": "110",
    "62": "3530",
    "63": "5913",
    "64": "9697",
    "65": "5445",
    "66": "2530",
    "67": "2567",
    "68": "2221",
    "69": "1482",
    "70": "9444",
    "71": "3411",
    "72": "9296",
    "73": "8461",
    "74": "3355",
    "75": "9168",
    "76": "5990",
    "77": "9158",
    "78": "9692",
    "79": "9385",
    "80": "5463",
    "81": "2386",
    "82": "9397",
    "83": "3481",
    "84": "2372",
    "85": "9300",
    "86": "2180",
    "87": "9219",
    "88": "3482",
    "89": "9431",
    "90": "3412",
    "91": "9388",
    "92": "9616",
    "93": "964",
    "94": "5460",
    "95": "1483",
    "96": "2331",
    "97": "9387",
    "98": "3183",
    "99": "9450",
    "100": "2387",
    "101": "9441",
    "102": "3456",
    "103": "9695",
    "104": "5743",
    "105": "3184",
    "106": "9290",
    "107": "9438",
    "108": "8158",
    "109": "9398",
    "110": "253",
    "111": "8195",
    "112": "9442",
    "113": "9392",
    "114": "9435",
    "115": "2388",
    "116": "5341",
    "117": "272",
    "118": "3454",
    "119": "2380",
    "120": "9382",
    "121": "5270",
    "122": "9677",
    "123": "2322",
    "124": "6582",
    "125": "9112",
    "126": "2182",
    "127": "9280",
    "128": "3457"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "label2id": {
    "110": 61,
    "1481": 21,
    "1482": 69,
    "1483": 95,
    "1991": 32,
    "1996": 9,
    "2180": 86,
    "2182": 126,
    "2221": 68,
    "2293": 18,
    "2321": 14,
    "2322": 123,
    "2331": 96,
    "2364": 33,
    "2372": 84,
    "2380": 119,
    "2381": 16,
    "2386": 81,
    "2387": 100,
    "2388": 115,
    "2420": 42,
    "2431": 53,
    "2440": 52,
    "2514": 45,
    "2526": 6,
    "253": 110,
    "2530": 66,
    "2545": 49,
    "2553": 25,
    "2557": 51,
    "2567": 67,
    "2571": 39,
    "272": 117,
    "3181": 27,
    "3183": 98,
    "3184": 105,
    "3185": 12,
    "3355": 74,
    "3411": 71,
    "3412": 90,
    "3414": 5,
    "3416": 13,
    "3451": 17,
    "3454": 118,
    "3456": 102,
    "3457": 128,
    "3481": 83,
    "3482": 88,
    "3483": 26,
    "3530": 62,
    "3540": 0,
    "5157": 22,
    "5270": 121,
    "5331": 23,
    "5341": 116,
    "5361": 7,
    "5445": 65,
    "5460": 94,
    "5463": 80,
    "5481": 54,
    "5500": 15,
    "5530": 44,
    "5620": 55,
    "5711": 41,
    "5743": 104,
    "5772": 20,
    "5913": 63,
    "5970": 59,
    "5982": 24,
    "5990": 76,
    "6582": 124,
    "7272": 56,
    "8158": 108,
    "8195": 111,
    "8311": 47,
    "8460": 10,
    "8461": 73,
    "8464": 1,
    "9112": 125,
    "9146": 30,
    "9158": 77,
    "9168": 75,
    "9180": 31,
    "9219": 87,
    "9280": 127,
    "9290": 106,
    "9291": 50,
    "9295": 11,
    "9296": 72,
    "9300": 85,
    "9350": 35,
    "9381": 38,
    "9382": 120,
    "9385": 79,
    "9386": 43,
    "9387": 97,
    "9388": 91,
    "9389": 60,
    "9391": 4,
    "9392": 113,
    "9393": 28,
    "9396": 58,
    "9397": 82,
    "9398": 109,
    "9431": 89,
    "9432": 46,
    "9433": 36,
    "9434": 37,
    "9435": 114,
    "9436": 2,
    "9437": 3,
    "9438": 107,
    "9439": 34,
    "9441": 101,
    "9442": 112,
    "9444": 70,
    "9450": 99,
    "9451": 48,
    "9461": 19,
    "9464": 57,
    "9480": 29,
    "9616": 92,
    "964": 93,
    "9677": 122,
    "9683": 40,
    "9692": 78,
    "9695": 103,
    "9697": 64,
    "9750": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.12.5",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29564
}
